In [1]:
import pandas as pd
import numpy as np

In [3]:
## load data
sachin_df = pd.read_csv('Sachin_ODI.csv')
sachin_df

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Century,Won
0,13,0,30,15,3,0,86.66,1,New Zealand,Napier,1995-02-16,New Zealand,No,No
1,37,0,75,51,3,1,72.54,2,South Africa,Hamilton,1995-02-18,South Africa,No,No
2,47,0,65,40,7,0,117.50,2,Australia,Dunedin,1995-02-22,India,No,Yes
3,48,0,37,30,9,1,160.00,2,Bangladesh,Sharjah,1995-04-05,India,No,Yes
4,4,0,13,9,1,0,44.44,2,Pakistan,Sharjah,1995-04-07,Pakistan,No,No
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
355,14,0,34,15,2,0,93.33,2,Australia,Sydney,2012-02-26,Australia,No,No
356,39,0,45,30,5,0,130.00,2,Sri Lanka,Hobart,2012-02-28,India,No,Yes
357,6,0,25,19,1,0,31.57,1,Sri Lanka,Dhaka,2012-03-13,India,No,Yes
358,114,0,205,147,12,1,77.55,1,Bangladesh,Dhaka,2012-03-16,Bangladesh,Yes,No
359,52,0,93,48,5,1,108.33,2,Pakistan,Dhaka,2012-03-18,India,No,Yes

In [4]:
sachin_df.shape

(360, 14)

## Probability of win : P(w)

In [6]:
sachin_df['Won'].value_counts()

Yes    184
No     176
Name: Won, dtype: int64

In [9]:
184 / 360

0.5111111111111111

In [7]:
df_won = sachin_df[sachin_df['Won'] == "Yes"]

In [8]:
len(df_won) / len(sachin_df)

0.5111111111111111

## Probability of scoring a century : P(c)

In [10]:
sachin_df['Century'].value_counts()

No     314
Yes     46
Name: Century, dtype: int64

In [11]:
46 / 360

0.12777777777777777

In [12]:
df_century = sachin_df[sachin_df['Century'] == "Yes"]

In [13]:
len(df_century) / len(sachin_df)

0.12777777777777777

## Probability of winning and century : P(W ^ C)

In [14]:
sachin_df[["Century", "Won"]].value_counts()

Century  Won
No       No     160
         Yes    154
Yes      Yes     30
         No      16
dtype: int64

In [15]:
sachin_df[["Century", "Won"]].value_counts().reset_index()

  Century  Won    0
0      No   No  160
1      No  Yes  154
2     Yes  Yes   30
3     Yes   No   16

In [17]:
pd.crosstab(index = sachin_df['Century'], columns = sachin_df['Won'], margins = True)

Won       No  Yes  All
Century
No       160  154  314
Yes       16   30   46
All      176  184  360

In [18]:
30 / 360

0.08333333333333333

In [19]:
df_won_century = sachin_df[(sachin_df['Century'] == "Yes") & (sachin_df['Won'] == "Yes")]

In [20]:
len(df_won_century) / len(sachin_df)

0.08333333333333333